-- MySQL dump 10.13  Distrib 5.7.31, for macos10.14 (x86_64)
--
-- Host: localhost    Database: finance
-- ------------------------------------------------------
-- Server version	5.7.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `stock_information_sector`
--

DROP TABLE IF EXISTS `stock_information_sector`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `stock_information_sector` (
  `code` text,
  `name` text,
  `type` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stock_information_sector`
--

LOCK TABLES `stock_information_sector` WRITE;
/*!40000 ALTER TABLE `stock_information_sector` DISABLE KEYS */;
INSERT INTO `stock_information_sector` VALUES ('gn210000','证金汇金','2'),('gn212000','智能穿戴','2'),('gn214000','智能电网','2'),('gn215000','智能家居','2'),('gn075000','京津冀一体化','2'),('hy001000','农林牧渔','1'),('gn219000','猪肉','2'),('hy002000','采矿业','1'),('gn222000','在线教育','2'),('hy003001','粮食加工','1'),('dy001000','北京','3'),('hy003002','食品制造','1'),('dy002000','天津','3'),('hy003003','茶酒饮料','1'),('dy003000','河北','3'),('hy003004','纺织业','1'),('dy004000','山西','3'),('hy003005','服装制造','1'),('dy005000','内蒙古','3'),('hy003006','皮毛制鞋','1'),('dy006000','辽宁','3'),('hy003007','木材加工','1'),('dy007000','吉林','3'),('gn077000','健康中国','2'),('hy003008','家具制造','1'),('dy008000','黑龙江','3'),('gn079000','节能环保','2'),('hy003009','造纸','1'),('dy009000','上海','3'),('gn084000','抗癌','2'),('hy003010','印刷','1'),('dy010000','江苏','3'),('gn098000','旅游','2'),('dy011000','浙江','3'),('gn102000','美丽中国','2'),('dy012000','安徽','3'),('gn111000','农垦改革','2'),('dy013000','福建','3'),('gn117000','苹果','2'),('dy014000','江西','3'),('gn121000','区块链','2'),('dy015000','山东','3'),('gn124000','人工智能','2'),('dy016000','河南','3'),('gn125000','燃料电池','2'),('dy017000','湖北','3'),('hy003011','传媒艺术','1'),('gn126000','人脸识别','2'),('hy003012','石油加工','1'),('hy010000','金融业','1'),('gn129000','乳制品','2'),('hy011000','房地产业','1'),('gn130000','深港通','2'),('hy012001','租赁和商务','1'),('gn131000','上海自贸区','2'),('hy013000','科研技术','1'),('gn133000','石墨烯','2'),('hy014000','旅游环境','1'),('gn136000','三沙','2'),('hy015000','服务业','1'),('gn139000','生态农业','2'),('hy016000','教育','1'),('gn142000','三网融合','2'),('hy017000','卫生','1'),('dy018000','湖南','3'),('hy018000','出版传媒','1'),('gn143000','手游','2'),('dy019000','广东','3'),('hy019000','综合','1'),('gn153000','铁路基建','2'),('hy003013','化学制品','1'),('dy020000','广西','3'),('gn003000','3D打印','2'),('dy021000','海南','3'),('gn006000','4G','2'),('dy022000','四川','3'),('gn007000','5G','2'),('dy023000','贵州','3'),('gn008000','安防','2'),('dy024000','云南','3'),('gn010000','北斗导航','2'),('dy025000','西藏','3'),('gn016000','参股基金','2'),('dy026000','重庆','3'),('gn022000','车联网','2'),('dy027000','陕西','3'),('gn024000','创投','2'),('gn028000','大数据','2'),('hy003014','医药制造','1'),('dy028000','甘肃','3'),('gn156000','特斯拉','2'),('hy003015','化纤制造','1'),('gn032000','独角兽','2'),('gn160000','网红','2'),('hy003016','橡胶塑料','1'),('gn035000','地热能','2'),('gn164000','物联网','2'),('hy003017','非金属制品','1'),('gn165000','网络游戏','2'),('gn036000','电商','2'),('hy003018','黑色金属','1'),('gn167000','无人驾驶','2'),('dy029000','青海','3'),('gn040000','二胎','2'),('hy003019','有色金属','1'),('gn168000','污水处理','2'),('gn041000','钒电池','2'),('dy030000','宁夏','3'),('hy003020','金属制品','1'),('gn172000','雄安新区','2'),('gn044000','风能','2'),('dy031000','新疆','3'),('hy003021','通用设备制造','1'),('gn174000','乡村振兴','2'),('gn047000','国产航母','2'),('dy032000','香港','3'),('hy003022','专用设备制造','1'),('gn050000','光伏','2'),('gn181000','新能源','2'),('gn052000','港口水运','2'),('gn182000','芯片国产化','2'),('gn055000','钢铁','2'),('hy003023','汽车制造','1'),('gn058000','工业4.0','2'),('hy003024','交运设备','1'),('gn059000','工业互联网','2'),('hy003025','电器制造','1'),('gn060000','核电','2'),('hy003026','通信设备','1'),('gn065000','航空','2'),('hy003027','仪器仪表','1'),('gn066000','互联网金融','2'),('gn069000','航运','2'),('hy003028','其他制造业','1'),('gn070000','IP','2'),('hy003029','废品利用','1'),('gn072000','家电行业','2'),('gn183000','新三板','2'),('gn073000','军工','2'),('gn184000','稀土永磁','2'),('hy004000','水电燃气','1'),('hy005000','建筑业','1'),('hy006000','批发零售','1'),('hy007000','交通物流','1'),('hy008000','餐饮酒店','1'),('gn187000','一带一路','2'),('hy009000','信息技术','1'),('gn195000','云计算','2'),('gn202000','医药','2'),('gn204000','页岩气','2');
/*!40000 ALTER TABLE `stock_information_sector` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-08-09 17:57:21
